/*###################################################################################################################*/

#pragma once
#include <vector>

/*-------------------------------------------------------------------------------------------------------------------*/
// Класс типов модуляции:

enum class Modulation
{

    NON,                                                                     // Отсуствует
    AMP,                                                                     // Амплитудная
    FRQ,                                                                     // Частотная
    PH                                                                       // Фазовая

};

/*-------------------------------------------------------------------------------------------------------------------*/
// Структура передачи параметров модуляции:

struct ModParameters
{
    using modF = double (*)(double);                                         // Тип - указатель на модулирующую функцию

    modF modFunction = nullptr;                                              // Модулирующая функция (указатель)
    Modulation modType = Modulation::NON;                                    // Тип модуляции
    double depth = 0;                                                        // Глубина модуляции

};

/*-------------------------------------------------------------------------------------------------------------------*/
// Модулирующие функции:

double v_line(double now);
double linear(double now);                                  
double code(double now);
double step(double now);

/*===================================================================================================================*/